[
  {
    "question_number": 1,
    "text": "Q1 (a) Identify both cattle breeds in A and B. A: Aberdeen Angus 5+1 B: Hereford (b) State which breed A or B has a dominant polled trait as a characteristic of the breed. 2 A or Aberdeen Angus (c) Explain the underlined term in part (b) above. Does not have horns"
  },
  {
    "question_number": 3,
    "text": "Q3 (a)(i) Outline reasons why farmers install cow brushes in cattle sheds. Allow cows to groom or scratch / reduce skin irritations / reduce stress or improved animal welfare / encourage natural behaviour / 3+3 cleaner cows or improved hygiene (for animal) / improved blood circulation (ii) Describe the advantages of one other named piece of farm technology in relation to environmental sustainability. 3+1 Two points on any named valid piece of technology relating to environmental sustainability OR (b)(i) Briefly explain how this technology would be safer for (1) animals and (2) the environment. Animals: Less risk to animals from noxious (harmful) gases 4+1 Environment: Reduction of greenhouse gases (which contribute to air pollution) / reduced runoff due to increased nutrient absorption by plants (ii) Apart from safety, outline ways this technology could benefit farmers. labour is reduced (as there is no need to agitate or move animals) / (as slurry is liquid) less blockages occur to equipment"
  },
  {
    "question_number": 4,
    "text": "Q4 (a)(i) Explain the underlined terms. Notifiable disease: (contagious disease) which must be reported to vet or DAFM (and causes huge economic loss) Zoonosis: disease that can be transmitted from animal to human (ii) Briefly describe how TB is spread within or between herds. Sale or movement of infected cattle can spread disease to other herds / contact between herds from neighbouring farms / contact 3 with infected wildlife / airborne transmission/ infected milk / contaminated feedstuffs or water / direct contact between animals (iii) Outline the advice you would give farmers to help prevent the disease entering their farms. Stock proof fencing on farm boundaries / culling infected animals / 2 named biosecurity measure or closed herd / regular testing / quarantine infected farms 13 OR (b)(i) Identify the bacteria that causes blackleg disease. 2 Clostridium chauvoei (ii) State where the bacteria identified can be found. 3 Soil / animal faeces (iii) Outline one symptom of the disease. Swollen joints or muscles / lameness / fever / rapid breathing / 3 lethargy / blackened tissue / crepitation (iv) Describe how blackleg can be prevented. Vaccination / remove from infected land"
  },
  {
    "question_number": 6,
    "text": "Q6 (a) Identify the three pieces of equipment needed for lambing. 3x1 (names) A: Stomach tube / C: heat lamp / D: ropes 3x1 (identified) (b) Briefly describe how any one of your named pieces of equipment identified is used during the lambing period. Stomach tube: Tube is placed into stomach through oesophagus to deliver milk to stomach 4 Heat lamp: The heat lamp is placed above the lamb Ropes: Ropes are tied above the hooves of lambs to pull lamb during birth"
  },
  {
    "question_number": 7,
    "text": "Q7 (a) List any two components of the soil microbiome. 4+1 Bacteria / fungi / actinomycetes (b) Outline how the soil microbiome contributes to one of the processes and state how this benefits productivity in a named catch or energy crop. 15 Plant carbon Carbon Plant growth Water retention sink sequestration promotion noitubirtnoC (Mycorrhizal Micro- Decomposition Symbiotic fungi) increase organisms feed of OM to humus relationship area for water on OM and for carbon (between plants absorption/ allow for storage in soil and mycorrhizal (bacteria and nutrient fungi/bacteria) fungi) break recycling (store fixes nitrogen or down OM to carbon) in soil makes humus which (biomass or phosphate increase water humus) available/ retention / mycorrhizal improves soil fungi produce structure growth hormones tifeneB Increased water Greater nutrient Improved soil Improved availability to availability for structure for nutrient the crop/ crop growth crop growth or availability reduces effects greater nutrient leading to of drought availability for improved yield / crop growth improved yield due to growth"
  },
  {
    "question_number": 8,
    "text": "Q8 (a) Outline the benefits of the nitrogen cycle to animal and /or crop production on Irish farms. Symbiotic bacteria or Rhizobium / convert N compounds into nitrates (nitrification) / legumes (clover) carry out nitrogen fixation/ 5+4+1 nitrates are available for plant use/ provides N to build proteins in plants or animals / healthy plant growth/ less fertiliser needed / more productive swards (so less need for concentrates) / more efficient fertiliser or slurry use / soil fertility maintenance"
  },
  {
    "question_number": 10,
    "text": "Q10 (a) Explain the underlined term. Terminal sire: a male parent / who is used for producing lambs for 3+1 slaughter or offspring not intended for breeding or raised for meat production (b) Describe the improvements to breeding and management a farmer could make to their sheep flock based on the information from the CT scan. Breeding: assessing muscle and fat would allow the farmer to choose whether to breed an animal to pass on genes 5+1 Management: allows farmer to make informed decision about feeding regime (to reach slaughter or target weights) / assessing muscle and fat would allow farmer to see ratio of each and decide if increased protein was needed in diet for muscle production 16"
  }
]