[
  {
    "question_number": 4,
    "text": "Question 4\nComplete the sentences below in relation to animal diseases using words from the list.\nPneumonia Red water fever Magnesium Orf Foot rot\n(a) Cows suffering from grass tetany are lacking in ……….\n(b) Footbaths are used in the treatment of ……….\n(c) Cows passing blood in their urine is an indicator of ……….\n(d) Rapid breathing and coughing in calves is an indicator of ……….\n(e) Lesions on the mouth, udder and nose of young lambs is ………."
  },
  {
    "question_number": 16,
    "text": "Question 16\n(a) Organic matter content is very important in soil health.\n(i) Explain the underlined term.\n(ii) Briefly describe two ways of increasing the organic matter content of soils.\n1.\n2.\n(iii) Describe the functions of soil organic matter under the headings that follow.\nFunction Description\nEffect on soil pH\nWater retention\n(holding)\nSoil compaction\n(iv) Briefly explain two factors that influence the amount of organic matter in a soil.\n(b) Describe with the aid of a labelled diagram how a student could carry out an investigation to\ndetermine the percentage organic matter in a 100g sample of soil.\nLabelled diagram:\n(c) The results of the investigation are shown in the box below.\nMass of organic matter 25g\n(i) Calculate the % organic matter of the soil sample tested in part (b).\nCalculation:\n(ii) Based on the results in part (i), state if the soil type is more likely to be a peat soil or\nbrown earth soil.\n(iii) All organic matter contains carbon.\nCalculate the % soil organic carbon in the soil sample using the equation shown in the\nbox below.\n% Soil Organic Carbon = % Soil Organic Matter X 0.58"
  },
  {
    "question_number": 17,
    "text": "Question 17\n(a) Read the article and the questions that follow.\n40-year-old straws used to sire calves on Tipperary farm\nA County Tipperary farm is currently home to\nsome of the most unique calves in Ireland\nbecause the calves in question were sired by a\nCanadian bull that was born 46 years ago.\nThe farmer chose this bull as he was classed by\nother farmers as ‘the best sire they had ever\nused’, due to his superb conformation.\nThe farmer used sexed semen and flushed five\ncows from the one straw to get one bull calf\nand one heifer calf.\n(Adapted from Agriland, 2023)\n(i) Sexed semen is when the X chromosome (female) and the Y chromosome (male) are\nseparated in the sperm.\nExplain why this technology is an advantage on farms.\n(ii) Outline one advantage of using straws from the Canadian bull that were 40 years old.\n(iii) Briefly describe two advantages and two disadvantages of Artificial Insemination (AI) in cattle.\nAdvantages Disadvantages\n1. 1.\n2. 2.\n(b) (i) Based on a named food crop (other than grass) you have studied, describe its growth\ncycle under the headings that follow.\nNamed food crop:\nLabelled diagram:\nGermination\nRipening\n(ii) Describe how the food crop named in part (i) above is harvested and stored.\nHarvested:\nStored:\n(iii) Outline one safety precaution that should be taken during harvesting this crop.\n(c) Integrated pest management systems are used to farm in a more sustainable way.\nAnalyse the diagram and the questions that follow.\nChemical\n(Pesticide)\nBiological\nPhysical /\nMechanical\nCultural /\nSanitation\nPrevention\nUsing the list of words below, state to which category of pest management they belong.\nMachine\nFans Predators Pesticides Crop rotation\nhygiene\nThe first one has been done as an example.\nCategory\nChemical Pesticides\nPhysical / Mechanical\nCultural / Sanitation"
  }
]