[
  {
    "question_number": 1,
    "solution": "Q1 (a) Complete the table below, by placing a tick ()in the correct box to show the\ndirection of grazing.\n 3\n(b) Label A in the diagram.\n3\n(Moveable)(Electric) Fence\n(c) Identify the type of grazing system shown in the diagram.\n2\nStrip grazing\n(d) Outline one advantage of this grazing system.\nLeafy grass or more digestible grass or less weeds or increase animal\nproduction / gives grass a chance to recover / less soil compaction / less\npoaching or damage to grass / less grass wastage / less disease"
  },
  {
    "question_number": 2,
    "solution": "Q2 (a) Identify the machines that are involved in the farming.\nFarming practice Machine name\nSpreading animal waste on land Slurry tanker\nReducing the temperature of milk Plate cooler 2(3) +\n2(2)\nTurn and break up soil Plough\nCompacts material into shape for storage Baler\nOr\n(b)(i) State one use for the cattle handling facilities on the farm.\nRestrain animals or allow treatment / prevent injury / reduce time or 3\nlabour\n(ii) Briefly explain one reason why handling facility B is better for animal movement.\n(As the animals go around the curve) they think they are going back to\nwhere they came from / the animals cannot see people and other moving 3\nobjects (at the end of the chute) / it takes advantage of the natural circling\nbehaviour of cattle / one-way system for ease of movement\n(iii) Outline one reason why the head gate labelled in picture A above is important\nwhen handling animals.\nEasy to operate / safe working with animals / administer medicine easily or 2\nany named treatment\n(iv) Apart from using a crush, outline one other safety precaution taken when\nhandling animals.\nBe careful of swinging gates / have another person present or tell\nsomeone / don’t stand too close / or another one valid precaution\n12"
  },
  {
    "question_number": 3,
    "solution": "Q3\nTrue False\n(i) Freeze thaw is a type of physical weathering in soil \n(ii) Clay has the largest soil particles \n5(2)\n(iii) Topography refers to the slope of the land \n(iv) Iron pans are found in brown earth soil profiles \n(v) Subsoil has a rich dark colour "
  },
  {
    "question_number": 4,
    "solution": "Q4 Complete the sentences below in relation to animal diseases using words from the list.\n(a) Magnesium\n(b) Foot rot\n(c) Red water fever\n(d) Pneumonia\n(e) Orf"
  },
  {
    "question_number": 5,
    "solution": "Q5 (a) Label any three parts of the diagram.\nA: Omasum\nB: Rumen\n3(2)\nC: Abomasum\nD: Reticulum\n(b) Identify the first feed required by the calf by\nHay\nplacing a tick () in the correct box.\nColostrum \n4\nMilk\nBarley"
  },
  {
    "question_number": 6,
    "solution": "Q6 (a)(i) Identify any three of the following breeds.\nA: Charolais\nB: Border Leicester\nC: Texel\nD: Suffolk\n(ii) Outline one reason why any named breed in part (i) above is suitable for sheep\nmeat production.\nCharollais – fine boned / long loin / muscular hindquarters / fast growing /\neasy to flesh / high KO%\nBorder Leicester – fast growing / prolific 4\nTexel – large amount of muscle / lean meat\nSuffolk – fast growing or early maturing / high quality carcass or excellent\nconformation / prolific\n13\nOr\n(b)(i) Explain selective grazers.\nCattle don't randomly consume forage / they display preferences for\n3\ncertain plant species or parts of plants or specific areas within the pasture\n(ii) Briefly outline the role of the herd of Luing cattle.\nAllow plants to recover / reduce competition for plants or valid example /\nallows space for new habitats\n(iii) Outline two advantages of the virtual fencing.\nReduced overgrazing / promotes conservation or targeted grazing / better\nweed control / better nutrient management or enhanced soil health /\n2(2)\nprotection of water sources / improved labour efficiencies or increased\nstocking rates / better animal welfare / reduced capital investment in\nfencing / locate livestock"
  },
  {
    "question_number": 7,
    "solution": "Q7 (a) Using the four headings in the diagram in relation to soil compaction, briefly\ndescribe how any three affect the growth of crops on the land.\nMachine size: big heavy machines compact the soil reducing the growth of\ncrops\nSoil water content: Increased water content allows soil particles to move\ntogether increases soil compaction which reduces crop growth 3(2)\nTillage system: Intensive or conventional tillage increases soil compaction\nreducing crop growth\nCrop rotation: planting different crops leads to less soil compaction and\nincreased crop growth\n(b) Identify the % air in the ideal soil composition.\n45%\n25% \n4\n5%"
  },
  {
    "question_number": 8,
    "solution": "Q8 (a) Briefly outline how any three advantages can improve the health and welfare of\nthe animals.\nHelp animals regulate body temperature / protects from cold or wet or\nharsh conditions or illness / helps to prevent colds or pneumonia or illness 3(2)\nor hypothermia or death / promotes LWG (liveweight gain) which\nincreases profits / reduced energy or vet or housing costs\n(b) Briefly explain how one piece of technology you have studied can improve\nanimals’ health and welfare on the farm.\nCollars can read the temperature of the cow and alert farmer if they are 4\nsick or / any other valid\n14"
  },
  {
    "question_number": 9,
    "solution": "Q9 (a)(i) Identify the part of the plant that is involved in nutrient absorption.\n3\nRoot(hairs)\n(ii) List two nutrients absorbed by plants.\n2(2)\nN / P / K / Ca / Mg / S / other valid\n(iii) Identify the bacteria found in clover\nroots which fix atmospheric nitrogen into nitrates to Lactobacillus\nbe used by the plant. Rhizobium  3\nClostridium\nOr\n(b) Complete the table below by stating two agricultural practices which contribute\nto water pollution and state two ways of protecting water quality from these\npractices.\nSlurry (manure) (effluent) spreading – buffer or riparian zone / don’t\nspread when heavy rain is forecast or don’t spread on slopes or near water\nsources / LESS (slurry only) / do not store manure near water sources /\ncorrect application rate or timing or soil test\n2(3) +\nFertiliser spreading – buffer or riparian zone / correct application rate or\ntiming or soil test / GPS for spreading\nAnimals crossing or drinking water from rivers or streams – fence off all\nrivers or streams or provide water troughs or buffer or riparian zone\nPesticides or herbicides – buffer or riparian zone / polyculture or crop\nrotation or valid example of indirect control / correct application rates /\nspread in correct weather conditions or timing"
  },
  {
    "question_number": 10,
    "solution": "Q10 (a) Explain artisan product.\nA food or drink that is made in a traditional manner using high quality\n2\ningredients / products created with a greater focus on the uniqueness /\nproducts with novelty or a sense of being close to the producer\n(b) Macroom Buffalo Mozzarella is an example of a product being supplied to a niche\nmarket. Identify the meaning of niche market.\nCountry or group of countries to which goods and services from\nanother country are sold\nSpecialised market with products aimed at satisfying the specific\n\nneeds of consumers\nGeneral direction in which a market is moving\n(c)(i) Using your knowledge of the composition of cow’s milk,\nplace a tick () in the correct box to show if the % of water\nLower 3\n(ii) State which nutrient makes it most suitable for cheese production.\nProtein or casein or whey\n15"
  },
  {
    "question_number": 11,
    "solution": "Q11 (a)(i) Identify the desired characteristic being selectively bred.\n3\nEgg production\n(ii) In step 2, state which hen A, B or C is the best offspring to breed future generations.\nA\n(iii) Using your knowledge of selective breeding, identify\nMarbling in meat\ntwo characteristics of dairy cattle.\nMilk volume \n2(2)\nEarly maturing\nMilk protein \nOr\n(b)(i) Identify two physical characteristics of the Belgian Blue.\nDouble muscled / muscular or good conformation / strong legs / sloping\n2(3)\nrump / blue and white or white in colour / wide shoulders / short neck /\nstraight back / fine skin\n(ii) State with reason which cow A or B a farmer would choose to cross with the\nBelgian Blue bull.\nCow: B or Charolais 2(2)\nReason: Big frame / continental breed / wide pelvis"
  },
  {
    "question_number": 12,
    "solution": "Q12 (a) Identify each of the following variables in the investigation.\nplant type / pot size / ruler or metre stick / amount of\nControl\nlight / amount of water\n2(3) + 2\nIndependent amount of fertiliser\nDependent plant growth\n(b) Briefly explain the relationship between the independent and dependent variables\nin this investigation.\nAs the different amounts of fertiliser are applied the plant growth (rate) 2\nwill differ\n16\nany 4 questions"
  },
  {
    "question_number": 13,
    "solution": "Q13 (a)(i) One of the areas Lisa decided to investigate was the botanical composition of the\nland. Describe with the aid of a labelled diagram how she would carry out this\ninvestigation.\nThrow pen at random / place quadrat / repeat at least 10 times / identify\n4(4)\nplants using key or plant ID app or acres guide book / record plants\npresent / calculate % frequency\nMarks can be awarded from diagram\n(ii) Identify any three of the plants.\nA: Nettle\nB: Dock leaf\n3(4)\nC: Clover\nD: Perennial Ryegrass\n(b)(i) Calculate the average % frequency A for the dock leaf.\n4/10 x 100/1 = 40% 6\nIf alone is given allow 6m\nIf calculation is shown with incorrect award 3m\n(ii) State with reason if the results shown in part (i) are qualitative or quantitative.\nState: Quantitative\n2(2)\nReason: Quantity or number of plants measured.\n(iii) Identify the most suitable chart or graph to display the above results by placing a\ntick () in the correct box.\nA B C\n6\n\n(iv) State with reason if this investigation is accurate.\nAccurate or Yes\nQuadrat was thrown multiple times / land areas chosen randomly / 2(3)\naverage value used / used approved plant key or book or app to identify\nplants\n17"
  },
  {
    "question_number": 14,
    "solution": "Q14 (a)(i) Briefly describe two ways a farmer could ensure a good grass yield at harvesting.\nFertiliser applied (6 weeks in advance) / slurry applied / grazed in spring\n2(3)\nprior to closing for silage / soil test (ensure adequate nutrients) / close for\n6 weeks / sow productive species or control weeds\n(ii) Identify the best time of the year to cut grass for silage by placing an X on the diagram.\nX\n3\n(iii) Briefly describe one disadvantage of the grass being cut at the wrong growth stage.\nLess digestible / poor yield / poor quality silage / increased concentrate costs\n(b)(i) Identify the correct stage of cutting the grass for silage by placing a tick () in the correct box.\nA B\n2\n\n(ii) Briefly outline one reason for your choice in part (i).\nLeafy grass / no seed heads / more digestible\n(Allow opposite points for A).\n(iii) Identify the growth stage of plant B by\nInflorescence\nplacing a tick () in the correct box.\nVegetative \nElongation\n(c)(i) One measure of silage quality is to measure the dry matter (DM)%.\nDescribe how a student carried out this investigation in the school laboratory.\nCut a number of grass samples / use a tissue to dry off any excess water\nfrom the grass / use a scissors to cut the grass into short lengths of similar\nsize / record mass of beaker / add grass to the beaker and record the mass\n/ determine mass of grass sample / place the grass in an oven (at 100 C) or 3(4)\nmicrowave at short intervals / repeat weighing / constant mass / mass of\nthe dry grass is equal to the dry matter / calculate the DM% of the grass by\nputting mass of dry grass over mass of fresh grass multiply by 100/1 /\ncalculate the average DM% for each treatment\n18\n(ii) Briefly describe two other ways to measure the quality of silage.\nsqueeze liquid from silage / place pH probe into liquid\nand note the reading or dip pH paper in the liquid and\npH\ncompare to the colour chart / low pH indicates good\nquality\nYellow - green indicates good quality / dark green\ncolour:\nindicates poor quality\nsharp acidic or vinegary indicates good quality / putrid or\nsmell\nrancid indicates poor quality\n2(2) +\nsqueeze with one hand / liquid removed indicates poor\nDM 2(2)\nquality / wring with two hands / little or no liquid\ncontent\nremoved indicates good quality\nrub the silage sample between your fingers / soft but firm\ntexture or fibres do not wear easily indicates good quality / wet\nand slimy indicates poor quality\nweigh sample of silage / separate leaves from the stems /\nleaf to\nweigh each separately / calculate the ratio of stem to\nstem\nleaves\nAllow 2 + 2 for name or description\n(d) Compare the preserving of grass as hay and silage under the headings which\nfollow using the list of words in the box.\nHay Silage\nLength of drying 5 – 7 days 24 hours 6(2)\nMethod of preservation Dehydration Fermentation\nStorage Shed Under plastic\n19"
  },
  {
    "question_number": 15,
    "solution": "Q15 (a)(i) Outline the management practices of the ewe at mating.\nFeeding: Flushing or high plane of nutrition or good quality grass\n2(4)\nHealth: reduce stress / good feet or footbath / dipping / good body\ncondition or BCS 3.0 - 3.5 / dagging\n(ii) Label the diagram of the female reproductive system.\nA B C D\n4(3)\nUterus Fallopian tube Ovary Cervix\n(b)(i) The ram is an important part of a flock and needs to be looked after and checked.\nBriefly describe two things farmers would check in advance of the breeding season.\nFeet or legs / mouth / testicles / BCS / fertility / disease\n(ii) Explain the purpose of the raddle.\n6\nTo mark the ewes that have been served.\n(iii) State how often a raddle colour would be changed by\n13 – 15 days \nplacing a tick () in the correct box below.\n22 – 24 days 2\n28 – 30 days\n(iv) Using the colours in the box below, list the colours\n1st colour Yellow / C\nin order of sequence used by the farmer during\nmating. 2nd colour Green / A 4 + 1 + 1\n3rd colour Blue / B\n(c)(i) Identify the average ratio of rams to ewes in a mid-season\n1:80\nlambing flock by placing a tick () in the correct box.\n1:40  6\n1:100\n(ii) Explain the importance of dagging the ewes prior to mating.\nTo allow for successful mating / prevent injury to the ram / prevent 2\nflystrike\nOr\n(d) Explain seasonal polyoestrous.\nEwes come into heat / a number of times or at a certain time of the year 6 + 2\n(when the days get shorter)\n20"
  },
  {
    "question_number": 16,
    "solution": "Q16 (a)(i) Explain organic matter.\nSoil organic matter is the part of the soil that consists of plant or animal 3\nremains in various stages of breakdown (decomposition).\n(ii) Briefly describe two ways of increasing the organic matter content of soils.\nAdd FYM / slurry / plough in crop or straw or green manures / improve 2(3)\ndrainage / reduce cultivation / add earthworms or microbial inoculants\n(iii) Describe the functions of soil organic matter under the headings that follow.\nFunction Description\nEffect on soil pH reduce pH\n3(2)\nWater retention (holding) improves water retention\nSoil compaction reduces soil compaction\n(iv) Briefly explain two factors that influence the amount of organic matter in a soil.\n2(3)\nplants / earthworm population or biological activity / another named valid\nagricultural practice\n(b) Describe with the aid of a labelled diagram how a student could carry out an\ninvestigation to determine the percentage organic matter in a 100g sample of soil.\nDry soil sample / weigh out 100g of the soil (using an electronic balance) /\nplace in a crucible/ heat over a Bunsen burner / burn off OM / weigh when\n3(4)\nstopped glowing or smoking / reweigh soil / loss in mass is equal to the\namount of organic matter / mass of organic matter ÷ dry weight x 100/1\nMarks may be awarded from the diagram\n(c)(i) The results of the investigation are shown in the box below.\nMass of organic matter 25g\nCalculate the % organic matter of the soil sample tested in part (b).\n6\n25/100 x 100/1 = 25(% OM)\nIf alone is given, award 6m\nIf calculation is shown with incorrect allow 3m\n(ii) Based on the results in part (i), state if the soil type is more likely to be a peat soil\nor brown earth soil.\nPeat soil 5\n(iii) Calculate the % soil organic carbon in the soil sample using the equation shown in\nthe box below.\n25 x 0.58 = 14.5(%)\nIf a candidate gives 14, 14.5 or 15 without showing calculation, award 6m\nIf the candidate uses the correct formula without correct , award 3m\n21"
  },
  {
    "question_number": 17,
    "solution": "Q17 (a)(i) Sexed semen is when the X chromosome (female) and the Y chromosome (male) are\nseparated in the sperm. Explain why this technology is an advantage on farms.\nFarmer gets to choose the sex of the calf / choose heifers for replacements\n3\nor allows for expansion or reduces male dairy calves or males for beef /\nreduces calving difficulty in maiden dairy heifers / maintains biosecurity\n(ii) Outline one advantage of using straws that were 40 years old.\nIncorporate genetics from years ago to get a better breed today / better 3\nconformation in calves / access to a wider choice\n(iii) Briefly describe two advantages and two disadvantages of Artificial Insemination\n(AI) in cattle.\nAdvantages: pick bull (breed) or wide choice of bulls (breed) / upgrade genetics\nor target specific genetic traits / less danger of having bull on farm / different\nbreeds available to suit different cows / easy calving bull for heifers / proven\nbull fertility / prevents sexually transmitted diseases / prevents injury / cost of\n2(5) +\nAI straw is little in comparison to that of a bull / semen can be sexed to produce\n2(1)\ngender of choice\nDisadvantages: heat detection / lower conception rates compared to a fertile\nbull / increased labour / trained professional required / specialist equipment /\nsemen must be properly stored / stock bull may still be required for mopping\nup\n(b)(i) Based on a named food crop (forage other than grass or for human consumption)\nyou have studied, describe its growth cycle under the headings which follow.\nBarley (or another valid crop):\nGermination: radicle grows down to develop roots / plumule grows up to\ndevelop shoot / cotyledon store for food\ncolour\nPotatoes:\n2(4)\nGermination: sprouts develop on tubers and grow upwards / roots develop\nfrom the base of the sprouts and grow down\nRipening: tubers fully grown / plant turns yellow / plant loses its leaves /\npotato skins harden\nKale:\ndevelop shoot / cotyledons emerge from the soil\nRipening: leaves grow to grazing or harvesting stage / stem elongates / leaf\nquality declines\nMarks may be awarded from the diagram\n22\n(ii) Describe how the food crop named in part (i) above is harvested and stored.\nBarley:\nHarvested: combine harvester / grain around 14 - 16% moisture / straw\nbaled or ploughed in\nStored: bales stored in shed / grain stored in rodent proof bins / treated\nwith fungicide / dried if moisture about 14%\nPotatoes:\nHarvested: burn off haulms using a contact herbicide / leave in the ground\n2(4)\nfor 3 weeks for skins to harden / elevator or chain digger / pick by hand or\nfully automated to storage bin\nStored: leak-proof or frost- proof or well-ventilated shed / store in stacks\nwith natural or forced ventilation / spray with sprout inhibitor / access for\ntractor and trailer\nKale:\nHarvested: strip grazed / zero grazed / ensiled\nStored: wrapped in plastic / bales stored in yard or fields\n(iii) Outline one safety precaution that should be taken during harvesting this crop.\nBe careful of PTO or don’t wear loose clothes / turn off machine when 4\nworking on it or any other valid example\n(c) Using the list of words below, state what category of pest management they\nbelong to.\nBiological predators or crop rotation\nPhysical / Mechanical fans or machine hygiene 4(3)\nCultural / Sanitation crop rotation or machine hygiene\nPrevention machine hygiene or crop rotation or fans\n23"
  },
  {
    "question_number": 18,
    "solution": "Q18 (a)(i) Outline three ways dairy farmers can prepare for the calving season in order to\nensure the survival of healthy calves.\nHave all equipment (calving jack etc.) / clean bedding / vet number /\n3(4)\nsupply of colostrum / experienced person present or adequate supervision\n/ CCTV / calving pen to isolate the cow / scanning / accept one description\nof hygiene / cow in good condition or BCS 3 – 3.5\n(ii) Briefly explain two practices carried out on the calf at birth.\nIodine on navel / ear tagging / colostrum fed to calf / clean bedding / clear\n6 + 5\nairways or check breathing / salt the calf or allow mother to lick the calf /\nassist delivery of calf\n(iii) Identify the breed of dairy cow shown.\n6\n(Holstein) Friesian\n(b) Using the target weights given in the list below, match the weights to the growth\nstage of the dairy animals.\nBirth 40kg\nWeaning 90kg\n5(3)\n1st housing 200kg\nMating 350kg\n1st calving 600kg\n(c) Explain the feeding of a dairy cow in the first 10 weeks of lactation during the\nperiod of negative energy balance.\n2(3)\nHigh plane of nutrition / concentrates / good quality silage (75%+ DMD) or\ngood quality spring grass\nOr\n(d) State the duration of each of the following in dairy cows.\nNumber of days\nLactation 300 - 305 4 + 1 + 1\nDry period 55 - 60\nGestation 280 -283\n24\n25\n26"
  }
]