[
  {
    "question_number": 1,
    "text": "Question 1\n(a) Identify the items of farm machinery or equipment shown in A, B and C.\nA\nB\nC\n(b) Briefly describe how the piece of equipment B in part (i) above is used on a sheep farm."
  },
  {
    "question_number": 2,
    "text": "Question 2 either (a) or (b).\n(a) (i) Identify any two of the following breeds.\nA B C\n(ii) The sheep in B in part (i) above is known for its prolificacy.\nExplain the underlined term.\n(iii) Briefly explain characteristics of bull C in part (i) above that make it suitable as a\nterminal sire.\nOr\n(b) Read the article and the questions that follow.\nThe Irish Moiled is one of the rarest Irish cattle breeds. It is a hornless\nmedium sized breed with a mature cow weighing up to 650kg.\nTraditionally a dairy cow with yields of up to 5000 litres, it has earned\nthe reputation as a truly dual purpose breed. In the suckler herd the\ncow will go into a negative energy balance to ensure the calf gets the\nbest start in life.\nThey are generally easy to handle with a placid docile temperament. Surplus males sell well as\nsteers finishing between 20-24 months on good quality forage diet to carcass weights from 220-\n260kg. The beef is of superb quality with a distinctive flavour.\nThe cow can be relied upon to produce a calf every 12\nmonths if kept in good health and body condition. They will\ncalve to a continental bull without difficulty and will continue\nto breed satisfactorily until at least ten years of age.\nTradition has it that they are ‘big bellied’ to consume and\ndigest large quantities of poorer quality forage which was\ntheir traditional diet. They can be termed ‘ready browsers’ because they will graze willow, ash\nand ivy, which makes them ideal in extensive or conservation grazing situations.\nThey are sound in hoof and leg and at home on most types of terrain. They grow a thick winter\ncoat and out-winter happily although being a heavy animal they will poach soft ground.\n(Adapted from thecattlesite.com)\n(i) Explain the underlined term.\n(ii) Identify one characteristic of this breed which makes it suitable as an artisan product.\n(iii) Describe one characteristic of the Irish Moiled which makes them a sustainable breed choice\non Irish farms.\nCharacteristic Description\nExample\nHigh producing cow without requiring large amounts of feed\nMedium size cow"
  },
  {
    "question_number": 4,
    "text": "Question 4\nDescribe the impact of soil compaction and organic matter\nloss has on the productivity of farm land in the table\nbelow.\nImpact of Effect on productivity Ways of reducing effect\nSoil\ncompaction\nOrganic\nmatter loss"
  },
  {
    "question_number": 5,
    "text": "Question 5\nCereal crops form the basis of many animal and human diets with an estimated 2.1 million tonnes\nbeing produced in 2023.\n(a) You have been asked to show a group of farmers barley, wheat and oats crops.\nAt the time of visiting the farm, each crop was at the stage shown in row 1.\nEach crop at its ripening stage is shown for reference in row 2.\nAssist farmers by identifying A, B and C as barley, wheat or oats.\nA B C\n1\nAuricles\nNo auricles and leaf margins Well-developed hairy\nLarge, hairless auricles\nare hairless auricles\n2\n(b) Farmers asked if the seed produced by the cereal crops above would be a suitable seed\nsource for sowing the next year.\nOutline the advice you would give the farmers."
  },
  {
    "question_number": 6,
    "text": "Question 6 either (a) or (b).\n(a) Many Irish sheep farmers now take part in the Sheep Improvement Scheme.\nSome of the target features / activities of this\nscheme are:\n lameness control\n mineral supplementation of ewe’s post mating\n meal feeding of lamb’s post weaning\n scanning of in-lamb ewes\nFor any two of the above listed target features / activities:\n(i) Describe how to action (carry out) these target features / activities.\n(ii) Describe the benefit of each target features / activities to overall production of the flock.\nNamed target feature /\nDescription\nactivity\n1. Action:\nBenefit:\n2. Action:\nOr\n(b) The Sheep Improvement Scheme provides financial support to farmers for taking extra steps\nto improve the welfare of their flock. Farmers get €12 per breeding ewe for completing flock\nwelfare measures.\nRyan and Fiona have the following sheep on their farm.\nStock type Numbers on farm\nRams 4\nBreeding ewes 132\nHoggets 42\nLambs 200\n(i) Calculate the financial value of the scheme to Ryan and Fiona.\nCalculation:\n(ii) The Sheep Improvement Scheme has been introduced to enhance animal health and\nwelfare in the sheep sector. Some of the target features of the scheme are:\n mineral supplementation of lambs pre-weaning\n flystrike control\n genotyping of ram\nBriefly explain how the scheme enhances animal health and welfare using any two of\nthe target features listed above.\nNamed target\nExplanation\nfeature\n1.\n2."
  },
  {
    "question_number": 7,
    "text": "Question 7\nRead the article and the questions that follow.\nAgroforestry is the integration of trees with either crops or livestock\non the same land. It aims to achieve additional benefits in\ncomparison to keeping agriculture and trees separate.\nAcross the world, agroforestry encompasses a wide variety of\npractices ranging from simple shelterbelts of trees around fields to a\nclose integration of food crops and trees.\n(Adapted from Teagasc, 2020)\n(a) Explain agroforestry.\n(b) Outline possible benefits of agroforestry for Irish agriculture."
  },
  {
    "question_number": 8,
    "text": "Question 8\nRead the article and the questions that follow.\nIrish Beetles Tackle Docks in New Trial\nIrish-bred beetles are set to become an\nenvironmentally friendly, cost-effective\nweapon to kill docks.\nOnce released on a farm, the dock beetle\nbreeds to colonise the whole field. Dock\nbeetles are native and natural predators\nof docks. They skeletonise dock leaves\ngrassland.\nThe population of dock beetle will\ninitially rise to decimate the dock weed\nnaturally. The population will reduce as\nits success diminishes its natural food supply in a sustainable way on an annual basis. They\nhibernate for the winter and reappear each spring.\n(Adapted from Irish Farmers Journal, 2022)\n(a) Explain the underlined term.\n(b) Briefly describe how the dock beetle is an environmentally friendly way of controlling dock\nleaves on a farm.\n(c) Dock beetles are an example of a biological control. Based on your own knowledge of\nagriculture, provide another example of a biological control and state its target.\nBiological control Target"
  },
  {
    "question_number": 9,
    "text": "Question 9 either (a) or (b).\n(a) Compare the different soil mineral particles and their properties under the headings that follow.\nThe first one has been done as an example.\nGravel and sand particles Silt and clay particles\nParticle size Large particles Small particles\nDrainage\nFertility\nIon exchange\nOr\n(b) Soil structure describes the arrangement of soil particles within a soil. These particles form\nclusters known as aggregates or peds in the soil.\n(i) Based on your knowledge of soil structure, identify the soil quality of each of the\ndifferent soils in A, B and C using the list below.\nModerate quality Poor quality Good quality\nA B C\n(ii) Briefly describe one reason for your choice of good quality soil structure in part (i) above."
  },
  {
    "question_number": 11,
    "text": "Question 11\nThe table below shows fertility summary data over five lactations\nfor two cows on the Irish Cattle Breeding Federation’s (ICBF)\n‘Cows Own Worth’ database.\nAnalyse the data and the questions that follow.\nCow 1 Cow 2\nCalving Calving\nCalving Lactation Lactation\nServes interval Serves interval\ndate number number\n(days) (days)\n30/01/2019 1 1 1 2\n27/01/2020 2 2 362 2 2 378\n28/02/2021 3 2 397 3 3 406\n08/02/2022 4 1 345 4 3 410\n11/03/2023 5 1 397 5 4 426\n(a) Calculate the average calving interval for cow 1.\nCalculation:\n(b) Briefly explain how the calving interval for cow 1 is reduced between lactation 3 and 4.\n(c) State with reason if cow 1 or 2 should be culled.\nCow:\nReason:"
  },
  {
    "question_number": 13,
    "text": "Question 13 both (a) and (b) with either (c) or (d).\n(a) (i) Gill, an agricultural advisor, carried out an investigation to determine the botanical\ncomposition of a farmer’s land.\nDescribe with the aid of a labelled diagram how she carried out this investigation.\nLabelled diagram:\n(ii) Gill identified the following plants on the land when carrying out the investigation.\nIdentify the plants A, B, C and D using the list below.\nRagwort Meadow Thistle Nettle Primrose\nA B C D\nGill wanted to provide advice to the farmers on ways to enhance plant biodiversity. She used the\nFarmland Plant Identification Key for the Agri-Climate Rural Environmental Scheme (ACRES) to\nhelp identify positive plant indicator species which would enhance biodiversity. The range and\ncover of positive plant indicators is one of the best ways of quantifying the biodiversity value of the\nhabitat (field).\nBiodiversity indicators Description\nGrassland which is not managed intensively\nPositive grassland indicators and contains plants such as Primrose and\nMeadow Thistle.\nGrassland is managed intensively and is used to\nNegative grassland indicators rapidly assess if land is in ‘poor’ condition. It\ncontains plants such as Ragwort and Nettles.\n(iii) Gill identified significant numbers of negative grassland indicators in her investigation.\nBriefly explain what advice Gill would give the farmer in order to create a positive\ngrassland for plant biodiversity.\n(b) (i) Describe with the aid of a labelled diagram how a peat soil is formed.\nLabelled diagram:\n(ii) State two locations in Ireland where you would find a peat soil.\n1.\n2.\n(c) You have been asked to address a group of farmers.\nOutline the advice you would give them about the importance of preserving our peat bogs.\nOr\n(d) Outline measures farmers can take to combat biodiversity loss on their farms."
  },
  {
    "question_number": 16,
    "text": "Question 16\n(a) Ella and Sadie are agricultural science students carrying out an\ninvestigation to determine the effect of feeding pooled\n(combining colostrum from a number of cows) high quality\ncolostrum on the health and performance of dairy calves.\nExperimental design was set up as follows.\nSample 1 Sample 2 Sample 3\nTreatment Pooled Own dam Colostrum from\ncolostrum colostrum another dam\nNumber of calves per\n20 20 20\ntreatment\nColostrum quality was determined by Brix Refractometer and only IgG (Immunoglobulin)\nconcentration of >50mg/ml was used\nCalves were weighed weekly\n(i) Outline a hypothesis for this investigation.\n(ii) State with reason if this investigation is a fair test.\nState:\nReason:\n(iii) State the independent, dependent and control variables in this investigation.\nIndependent\nDependent\nControl\n(iv) Outline two possible sources of error in this investigation.\n1.\n2.\n(b) Results of the investigation are shown in the table below.\nAnalyse the table and the questions that follow.\nSample number Colostrum IgG Average Average weaning\nTreatment group (mg/ml) birthweight (kg) weight (kg)\nSample 1\n100.7 34.0 94.0\nPooled colostrum\nSample 2\n99.4 33.3 93.7\nOwn dam colostrum\nSample 3\n95.2 34.3 91.7\nColostrum from another dam\n(Adapted from Teagasc, 2019)\n(i) Based on the results shown, state if there is any difference in colostrum quality when\npooled.\n(ii) Outline advice Ella and Sadie would give to farmers based on the results of their\ninvestigation.\n(c) Describe how changes of diet from birth to weaning affects the development of the\nruminant stomach.\n(d) Discuss the importance of feeding colostrum to young animals under the headings that follow:\n(i) Timing of feeding.\n(ii) Amount of colostrum.\n(iii) Hygiene."
  }
]