[
  {
    "question_number": 1,
    "text": "Question 1\nAn agricultural science student wanted to test the pH of a sample of soil before deciding what\ncrops to sow.\npH probe\nB\nUniversal\nIndicator\nC\nA\n(a) Identify any two pieces of equipment labelled A, B or C required for this investigation.\nA:\nB:\nC:\n(b) State the pH of the soil filtrate.\n(c) State a conclusion the student can make in relation to growing crops."
  },
  {
    "question_number": 10,
    "text": "Question 10 either (a) or (b).\n(a) Four out of every five calves born on beef farms\nare sired by a stock bull. The stock bull fertility is\nkey to maintaining a compact calving period,\nincreasing the genetic merit and value of the\ncalves, and overall herd profitability.\n(i) Explain the underlined terms.\nCompact calving period:\nIncreasing genetic merit:\n(ii) Briefly describe ways to ensure the stock bull on the farm is fertile during the breeding\nseason.\nOr\n(b) The vet was called to a farm to carry out a fertility test on four stock bulls. The vet collected\na sample of semen from the four bulls for analysis. The results are shown in the table below.\nAnalyse the table and the questions which follow.\nBull 1 Bull 2 Bull 3 Bull 4\nSperm motility (%) 100 95 90 95\nAbnormal structure (%) 5 8 8 10\n(i) Identify which bull has the most abnormal sperm cells.\n(ii) Identify which bull has the best sperm motility.\n(iii) State which bull is the most fertile and best to use with the maiden heifers on the farm.\n(iv) The vet asked for the bulls to be restrained for the procedure.\nOutline how the bulls could be restrained for the vet to carry out the procedure."
  },
  {
    "question_number": 11,
    "text": "Question 11\nA student was carrying out an investigation to show the activity of earthworms.\nDraw a labelled diagram showing this activity.\nLabelled diagram:"
  },
  {
    "question_number": 12,
    "text": "Question 12\nRead the article and the questions which follow.\nUsing a Portable Microscope in Agriculture\nYou sow seeds, water them and collect the harvest. Crop\nproduction involves continuous monitoring and inspection.\nCrop plants respond to environmental changes and many\ninternal factors. Plants are also prone to many diseases\ncaused by organisms. Some of these diseases are contagious.\nFarmers often need to send away diseased crop samples for\nfurther analysis including microscopic analysis. The\ndevelopment of portable microscope technology will allow\nfor on-site testing.\n(Adapted from Medprimetech, 2022)\n(a) Explain the underlined term.\n(b) List two examples of environmental factors that can affect crop production.\n1.\n2.\n(c) Briefly explain how this new onsite technology can benefit crop production.\nLabel all work clearly with the question number and part.\nany four questions.\nEach question carries 50 marks."
  },
  {
    "question_number": 16,
    "text": "Question 16\n(a) (i) Pat is doing a screening on his dairy herd. He wanted to check the quality of a milk\nsample.\nDescribe with the aid of a labelled diagram, how he would carry out this investigation.\nLabelled diagram:\n(ii) Identify the following variables in the investigation in part (i).\nIndependent\nDependent\nControl\n(iii) State with reason if the data collected is qualitative or quantitative.\nData type:\nReason:\n(b) (i) Based on the results of his investigation, he noticed that the total bacterial count (TBC)\nhad increased.\nOutline ways Pat could reduce the number of bacteria entering the milk.\n(ii) Pat gets paid for the milk produced based on its quality using the calculation A + B – C.\nCalculate the price Pat gets for 1000 litres of his milk in the table below if the milk fat is\n3.8% and protein is 3.4%.\nMilk composition of\nMilk composition price Price per kg (€)\n1000 litres\nA Fat (€4.48/kg fat) 39.0kg of fat 174.72\nB Protein (€9.07/kg protein) 35.0kg of protein 317.45\nC Processing cost deduction (€0.04/l) 40.00\nTotal price / 1000 litres ?\nCalculation:\n(c) Read the article below and the questions which follow.\nIrish-based ration achieves 47% reduction in emissions\nA large portion of dairy rations fed to cattle on Irish\nfarms are made using ingredients from outside of\nIreland and the European Union (EU).\nBecause of this, the emissions associated with these\nrations are quite high, and these contribute towards\noverall farm emissions. The farm is focused on\nbecoming the first climate-neutral dairy farm, with a wide range of measures being\nused to achieve this target.\nOne of the measures used on the farm is the feeding of a concentrate ration made\nfrom Irish sources. The ration fed to cows on the Shinagh demonstration farm is\nmade from Irish oats (33%), Irish beans (33%) and Irish barley (34%).\n(Adapted from Agriland, 2022)\n(i) Explain the underlined term.\n(ii) Outline why each of the following ingredients are added to the diet of a dairy cow.\nBeans\nBarley"
  },
  {
    "question_number": 17,
    "text": "Question 17\nA young farmer purchased 20 ewes in his local mart in late\nNovember. The farmer doesn’t know exactly how long the\newes are in lamb or if they are barren. The farmer got\nultrasound scanning done on the ewes.\n(a) (i) Briefly describe the advantages of ultrasound\nscanning.\n(ii) Explain the importance of having a good marking system for the ewes at scanning.\n(iii) The results of scanning twenty\nNumber of lambs being\newes are shown in the table.\nNumber of ewes\ncarried by the ewes\n0 2\n1 6\nOutline the advice you would give\non the management of the ewes, 2 7\nbased on the results.\n3 4\n4 1\n(b) The results from scanning the twenty ewes showed they were due to lamb in early March.\n(i) Advise the farmer as when to house the ewes prior to lambing.\n(ii) Suggest reasons for housing the ewes prior to lambing.\n(iii) List features of winter housing for sheep.\n(c) Describe the management practices carried out on lambs in the first week after birth under\nthe following headings.\nFeeding\nHousing\nHealth"
  }
]