[
  {
    "question_num": "2",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Identify any four of the following breeds of animals.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "A:",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "B:",
            "solution": [],
            "skip": false
          },
          {
            "id": "iii",
            "text": "C:",
            "solution": [],
            "skip": false
          },
          {
            "id": "iv",
            "text": "D:",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "b",
        "text": "A farmer was looking to select a female replacement animal for breeding for his chosen animal enterprise. Describe characteristics he would be looking for when selecting the animal.",
        "solution": [],
        "skip": true
      }
    ]
  },
  {
    "question_num": "3",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Eanna wanted to sow barley on his farm and decided to investigate the effect of soil temperature on the germination of the crop. Describe how he would carry out this investigation.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "State with reason if the results obtained by Eanna will be qualitative or quantitative.",
        "solution": [],
        "skip": false
      },
      {
        "id": "c",
        "text": "Suggest what information Eanna learns about the effect of temperature on the germination of seeds from this investigation which will inform his decision making on growing crops on his farm.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "4",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Explain the underlined term.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Avian influenza is a notifiable disease. List two other notifiable diseases on farms.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "1.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "2.",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "c",
        "text": "Using your knowledge of biosecurity measures describe how poultry farms could protect their flocks from avian influenza.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "6",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Since 1994, it has been compulsory for each European Union (EU) member state to have agri‐environment schemes. Outline three reasons why hedgerow conservation is promoted in agri‐environmental schemes.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Sustainable farming practices can benefit from conservation grazing. Explain the purpose of conservation grazing.",
        "solution": [],
        "skip": false
      },
      {
        "id": "c",
        "text": "Outline one reason why it is important to preserve rare animal breeds on farms.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "8",
    "context": "The European Commission has set targets for sustainable food production by 2030. 2030 Targets for Sustainable Food Production Pesticides Nutrient Losses Antimicrobials Organic Farming Reduce the overall use Reduce nutrient losses by Reduce use of antibiotics Increase the percentage and risk of chemical and 50% for farm animals of organically farmed hazardous pesticides land in the EU (Adapted from European Commission, 2020)",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Explain one way for each part (i) and (ii) below farmers can:\nReduce the use of (i) pesticides on their farm\nReduce use of (ii) antibiotics for farm animals",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "One way for farmers to reduce the use of pesticides on their farm:",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "One way for farmers to reduce the use of antibiotics for farm animals:",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "b",
        "text": "In Ireland 2% of the farming area is devoted to organic production. Briefly explain two benefits of converting to organic farming to a group of farmers.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Benefit one:",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Benefit two:",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "9",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "(i) Draw a labelled diagram of a calf’s stomach in its first week of life.\n(ii) Describe how the calf’s stomach in part (i) above differs from an adult ruminant stomach.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Read the article on the SEASOLUTIONS Project and the questions which follow.\nSEASOLUTIONS PROJECT Reducing methane emissions from ruminants is one of the biggest challenges to face the agricultural sector in the last decade. The SEASOLUTIONS Project is committed to making a positive impact on methane emissions in agriculture. By using seaweeds and seaweed derived ingredients to positively affect the rumen and rumen microbiota to reduce methane emissions and improve ruminant health. By adding seaweed components to the feed of sheep and cattle indoors on high grain based diets, Irish researchers have reduced methane production by 20%. A critical aspect of this project is to test such seaweed supplements within the context of a pasture‐based production system. (Adapted from SEASOLUTIONS.ie and Teagasc, 2021)\n(i) Outline two roles of micro‐organisms in the ruminant stomach.\n(ii) Describe why is it critical for the researchers to test the seaweed supplements stated above within the context of a pasture‐based production system.\n(iii) Meat samples will also be collected as part of the trial to ensure the seaweed or seaweed extracts have no effect on meat quality. Outline why this aspect of the trial is important.",
        "solution": [],
        "skip": true,
        "subparts": [
          {
            "id": "i",
            "text": "Outline two roles of micro‐organisms in the ruminant stomach.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Describe why is it critical for the researchers to test the seaweed supplements stated above within the context of a pasture‐based production system.",
            "solution": [],
            "skip": false
          },
          {
            "id": "iii",
            "text": "Meat samples will also be collected as part of the trial to ensure the seaweed or seaweed extracts have no effect on meat quality. Outline why this aspect of the trial is important.",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "13",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Maintaining a constant supply of high quality leafy grass can be easily achieved by managing and measuring the amount of grass on the farm.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Outline two advantages of grass measuring. 1. 2.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Grass is measured in kg DM/ha (kilograms dry matter per hectare). Every 1cm has approximately 250kg DM/ha for cattle farms. A residual post grazing height of 4cm is used when estimating grass cover. Calculate the kg DM/ha with a sward height of 10cm. Calculation: kg DM/ha =",
            "solution": [],
            "skip": false
          },
          {
            "id": "iii",
            "text": "A farmer identified different plants in the sward while measuring the grass. Identify any two of the following plants A, B or C from the sward. A: B: C:",
            "solution": [],
            "skip": false
          },
          {
            "id": "iv",
            "text": "Identify the growth cycle stage of the plants in part (iii) and describe briefly what happens at this stage. Stage: Description:",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "b",
        "text": "Gerry wants to reseed his grassland pastures.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Outline three advantages of reseeding grassland pastures. 1. 2. 3.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "In order to reseed his grassland, Gerry ordered two batches of seeds, certified and uncertified. On arrival both batch were unlabelled. He carried out a research trial to distinguish between the two batches of seeds. Describe using a labelled diagram, how he Labelled diagram:",
            "solution": [],
            "skip": true
          },
          {
            "id": "iii",
            "text": "Gerry was able to compare the plant uniformity of both batches of seed (certified and uncertified). Describe the characteristics Gerry would have observed to determine which batch was certified and which was uncertified.",
            "solution": [],
            "skip": false
          },
          {
            "id": "iv",
            "text": "Gerry decided to use certified seed when reseeding his pasture. Outline the effects his decision would have on the environmental sustainability of his farm.",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  }
]