[
  {
    "question_num": "1",
    "context": "",
    "skip": true,
    "parts": [
      {
        "id": "a",
        "text": "Identify the items of farm machinery or equipment shown in A, B and C.",
        "solution": [],
        "skip": true
      },
      {
        "id": "b",
        "text": "Briefly describe how the piece of equipment B in part (i) above is used on a sheep farm.",
        "solution": [],
        "skip": true
      }
    ]
  },
  {
    "question_num": "2",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "(i) Identify any two of the following breeds.\nA B C\n(ii) The sheep in B in part (i) above is known for its prolificacy. Explain the underlined term.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Characteristic one:",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Characteristic two:",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "b",
        "text": "Read the article and the questions that follow.\nThe Irish Moiled is one of the rarest Irish cattle breeds. It is a hornless medium sized breed with a mature cow weighing up to 650kg.\nTraditionally a dairy cow with yields of up to 5000 litres, it has earned\nthe reputation as a truly dual purpose breed. In the suckler herd the\ncow will go into a negative energy balance to ensure the calf gets the\nbest start in life.\nThey are generally easy to handle with a placid docile temperament. Surplus males sell well as\nsteers finishing between 20-24 months on good quality forage diet to carcass weights from 220-\n260kg. The beef is of superb quality with a distinctive flavour.\nThe cow can be relied upon to produce a calf every 12\nmonths if kept in good health and body condition. They will\nbreed satisfactorily until at least ten years of age.\nTradition has it that they are ‘big bellied’ to consume and\ndigest large quantities of poorer quality forage which was\ntheir traditional diet. They can be termed ‘ready browsers’ because they will graze willow, ash\nand ivy, which makes them ideal in extensive or conservation grazing situations.\nThey are sound in hoof and leg and at home on most types of terrain. They grow a thick winter\ncoat and out-winter happily although being a heavy animal they will poach soft ground.\n(Adapted from thecattlesite.com)\n(i) Explain the underlined term.\n(ii) Identify one characteristic of this breed which makes it suitable as an artisan product.\n(iii) Describe one characteristic of the Irish Moiled which makes them a sustainable breed choice on Irish farms.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Characteristic one:",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Characteristic two:",
            "solution": [],
            "skip": false
          },
          {
            "id": "iii",
            "text": "Characteristic three:",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "4",
    "context": "Describe the impact of soil compaction and organic matter\nloss has on the productivity of farm land in the table below.",
    "skip": true,
    "parts": [
      {
        "id": "a",
        "text": "Describe the impact of soil compaction and organic matter loss has on the productivity of farm land.",
        "solution": [],
        "skip": true
      },
      {
        "id": "b",
        "text": "Ways of reducing effect",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "5",
    "context": "Cereal crops form the basis of many animal and human diets with an estimated 2.1 million tonnes being produced in 2023.",
    "skip": true,
    "parts": [
      {
        "id": "a",
        "text": "You have been asked to show a group of farmers barley, wheat and oats crops. At the time of visiting the farm, each crop was at the stage shown in row 1. Each crop at its ripening stage is shown for reference in row 2. Assist farmers by identifying A, B and C as barley, wheat or oats.",
        "solution": [],
        "skip": true
      },
      {
        "id": "b",
        "text": "Farmers asked if the seed produced by the cereal crops above would be a suitable seed source for sowing the next year. Outline the advice you would give the farmers.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "6",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Many Irish sheep farmers now take part in the Sheep Improvement Scheme. Some of the target features / activities of this scheme are: lameness control, mineral supplementation of ewe’s post mating, meal feeding of lamb’s post weaning, scanning of in-lamb ewes. For any two of the above listed target features / activities:",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Describe how to action (carry out) these target features / activities.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Describe the benefit of each target feature / activity to overall production of the flock.",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "b",
        "text": "The Sheep Improvement Scheme provides financial support to farmers for taking extra steps to improve the welfare of their flock. Farmers get €12 per breeding ewe for completing flock welfare measures. Ryan and Fiona have the following sheep on their farm.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Calculate the financial value of the scheme to Ryan and Fiona.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "The Sheep Improvement Scheme has been introduced to enhance animal health and welfare in the sheep sector. Some of the target features of the scheme are: mineral supplementation of lambs pre-weaning, flystrike control, genotyping of ram. Briefly explain how the scheme enhances animal health and welfare using any two of the target features listed above.",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "7",
    "context": "Agroforestry is the integration of trees with either crops or livestock on the same land. It aims to achieve additional benefits in comparison to keeping agriculture and trees separate. Across the world, agroforestry encompasses a wide variety of practices ranging from simple shelterbelts of trees around fields to a close integration of food crops and trees.",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Explain agroforestry.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Outline possible benefits of agroforestry for Irish agriculture.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "8",
    "context": "Irish Beetles Tackle Docks in New Trial\nIrish-bred beetles are set to become an environmentally friendly, cost-effective weapon to kill docks. Once released on a farm, the dock beetle breeds to colonise the whole field. Dock beetles are native and natural predators of docks. They skeletonise dock leaves grassland. The population of dock beetle will initially rise to decimate the dock weed naturally. The population will reduce as its success diminishes its natural food supply in a sustainable way on an annual basis. They hibernate for the winter and reappear each spring. (Adapted from Irish Farmers Journal, 2022)",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Explain the underlined term.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Briefly describe how the dock beetle is an environmentally friendly way of controlling dock leaves on a farm.",
        "solution": [],
        "skip": false
      },
      {
        "id": "c",
        "text": "Dock beetles are an example of a biological control. Based on your own knowledge of agriculture, provide another example of a biological control and state its target.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "9",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Compare the different soil mineral particles and their properties under the headings that follow.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Particle size Large particles Small particles\nDrainage\nFertility\nIon exchange",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "",
            "solution": [],
            "skip": true
          }
        ]
      },
      {
        "id": "b",
        "text": "Soil structure describes the arrangement of soil particles within a soil. These particles form\nclusters known as aggregates or peds in the soil.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Based on your knowledge of soil structure, identify the soil quality of each of the\ndifferent soils in A, B and C using the list below.\nModerate quality Poor quality Good quality\nA B C",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Briefly describe one reason for your choice of good quality soil structure in part (i) above.",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  },
  {
    "question_num": "11",
    "context": "The table below shows fertility summary data over five lactations for two cows on the Irish Cattle Breeding Federation’s (ICBF) ‘Cows Own Worth’ database.",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Calculate the average calving interval for cow 1.",
        "solution": [],
        "skip": false
      },
      {
        "id": "b",
        "text": "Briefly explain how the calving interval for cow 1 is reduced between lactation 3 and 4.",
        "solution": [],
        "skip": false
      },
      {
        "id": "c",
        "text": "State with reason if cow 1 or 2 should be culled. Cow: Reason:",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "13",
    "context": "",
    "skip": true,
    "parts": [
      {
        "id": "a",
        "text": "(i) Gill, an agricultural advisor, carried out an investigation to determine the botanical composition of a farmer’s land. Describe with the aid of a labelled diagram how she carried out this investigation.",
        "solution": [],
        "skip": true
      },
      {
        "id": "a",
        "text": "(ii) Gill identified the following plants on the land when carrying out the investigation. Identify the plants A, B, C and D using the list below.\nRagwort Meadow Thistle Nettle Primrose\nA B C D",
        "solution": [],
        "skip": false
      },
      {
        "id": "a",
        "text": "(iii) Gill identified significant numbers of negative grassland indicators in her investigation. Briefly explain what advice Gill would give the farmer in order to create a positive grassland for plant biodiversity.",
        "solution": [],
        "skip": false
      }
    ]
  },
  {
    "question_num": "16",
    "context": "",
    "skip": false,
    "parts": [
      {
        "id": "a",
        "text": "Ella and Sadie are agricultural science students carrying out an investigation to determine the effect of feeding pooled (combining colostrum from a number of cows) high quality colostrum on the health and performance of dairy calves. Experimental design was set up as follows.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Outline a hypothesis for this investigation.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "State with reason if this investigation is a fair test.",
            "solution": [],
            "skip": false,
            "subparts": [
              {
                "id": "a",
                "text": "State:",
                "solution": [],
                "skip": false
              },
              {
                "id": "b",
                "text": "Reason:",
                "solution": [],
                "skip": false
              }
            ]
          },
          {
            "id": "iii",
            "text": "State the independent, dependent and control variables in this investigation.",
            "solution": [],
            "skip": false,
            "subparts": [
              {
                "id": "a",
                "text": "Independent:",
                "solution": [],
                "skip": false
              },
              {
                "id": "b",
                "text": "Dependent:",
                "solution": [],
                "skip": false
              },
              {
                "id": "c",
                "text": "Control:",
                "solution": [],
                "skip": false
              }
            ]
          },
          {
            "id": "iv",
            "text": "Outline two possible sources of error in this investigation.",
            "solution": [],
            "skip": false,
            "subparts": [
              {
                "id": "a",
                "text": "1.",
                "solution": [],
                "skip": false
              },
              {
                "id": "b",
                "text": "2.",
                "solution": [],
                "skip": false
              }
            ]
          }
        ]
      },
      {
        "id": "b",
        "text": "Results of the investigation are shown in the table below. Analyse the table and the questions that follow.",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Based on the results shown, state if there is any difference in colostrum quality when pooled.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Outline advice Ella and Sadie would give to farmers based on the results of their investigation.",
            "solution": [],
            "skip": false
          }
        ]
      },
      {
        "id": "c",
        "text": "Describe how changes of diet from birth to weaning affects the development of the ruminant stomach.",
        "solution": [],
        "skip": false
      },
      {
        "id": "d",
        "text": "Discuss the importance of feeding colostrum to young animals under the headings that follow:",
        "solution": [],
        "skip": false,
        "subparts": [
          {
            "id": "i",
            "text": "Timing of feeding.",
            "solution": [],
            "skip": false
          },
          {
            "id": "ii",
            "text": "Amount of colostrum.",
            "solution": [],
            "skip": false
          },
          {
            "id": "iii",
            "text": "Hygiene.",
            "solution": [],
            "skip": false
          }
        ]
      }
    ]
  }
]